class MsgId:
    """
    Message id constants
    """
    # Responce codes starts from 2 {mapIdName:{20000:"Авторизация",20001:"Запрос PIN",20002:"Ответ на запрос длины
    # пароля",20003:"Ответ на запрос смены пароля",20004:"Сообщения авторизации",20005:"Результат сохранения
    # профиля",20008:"Статус соединения",20014:"Сообщения сервера",21000:"Классы",21001:"Заявки",21003:"Сделки",
    # 21004:"Денежн.лимиты",21005:"Бумаж.лимиты",21006:"Ограничения",21007:"Позиции",21008:"Сообщения брокера",
    # 21009:"Ответы на транзакции",21011:"Основные торги",21011:"Торги для ТТП",21012:"Купить/Продать",
    # 21013:"Портфель",21014:"Стаканы",21015:"Ответ по RFS",21016:"Графики",21017:"Новости",21018:"Тексты новостей",
    # 21019:"Валютные пары",21020:"Инфо по бумаге",21021:"Котировки RFS",21022:"Торговые счета",21023:"Торги по
    # вал.парам",21024:"Список вал.пар",22000:"Ответ по заявке",22001:"Ответ по стоп-заявке",22002:"Ответ по
    # связ.стоп-заявке",22003:"Ответ по услов.стоп-заявке",22004:"Ответ по FX-заявке",22100:"Ответ по снятию заявки",
    # 22101:"Ответ по снятию стоп-заявки"},
    MSG_ID_AUTH = 20006
    MSG_ID_TRADE_SESSION_OPEN = 20000
    MSG_ID_EXIT = 10006
    MSG_ID_CREATE_DATASOURCE = 11016
    MSG_ID_CREATE_LEVEL2_DATASOURCE = 11014
    MSG_ID_QUOTES = 21011
    MSG_ID_GRAPH = 21016
    MSG_ID_LEVEL2 = 21014

    # Broker messages ???
    MSG_ID_ORDERS = 21001  # 21001:"Заявки",
    MSG_ID_TRADES = 21003  # 21003:"Сделки",
    MSG_ID_LIMITS = 21004  # 21004:"Денежн.лимиты"
    MSG_ID_STOCK_LIMITS = 21005  # 21005:"Бумаж.лимиты",
    MSG_ID_POSITIONS = 21007  # 21007:"Позиции"
    MSG_ID_TRANS_REPLY = 21009  # 21009:"Ответы на транзакции"
    MSG_ID_BUYSELL = 21012  #:"Купить/Продать",
    MSG_ID_PORTFOLIO = 21013  # 21013:"Портфель",
    #MSG_ID_LEVEL2 = 21014,  # 21014:"Стаканы"
    MSG_ID_ORDER_ANSWER = 22000  # 22000:"Ответ по заявке"
    MSG_ID_STOP_ORDER_ANSWER = 22001  # 22001:"Ответ по стоп-заявке"
    MSG_ID_LINKED_STOP_ORDER_ANSWER = 22002  # 22002:"Ответ по связ.стоп-заявке"
    MSG_ID_CONDITIONAL_STOP_ORDER_ANSWER = 22003  # 22003:"Ответ по услов.стоп-заявке"
    MSG_ID_FX_ORDER_ANSWER = 22004  # ,22004:"Ответ по FX-заявке",
    MSG_ID_REMOVE_ORDER_ANSWER = 22100  # 22100:"Ответ по снятию заявки",
    MSG_ID_REMOVE_STOP_ORDER_ANSWER = 22101  # 22101:"Ответ по снятию стоп-заявки"
