class MsgId:
    """
    Message id constants
    """
    # Responce codes starts from 2 {mapIdName:{20000:"Авторизация",20001:"Запрос PIN",20002:"Ответ на запрос длины
    # пароля",20003:"Ответ на запрос смены пароля",20004:"Сообщения авторизации",20005:"Результат сохранения
    # профиля",20008:"Статус соединения",20014:"Сообщения сервера",21000:"Классы",21001:"Заявки",21003:"Сделки",
    # 21004:"Денежн.лимиты",21005:"Бумаж.лимиты",21006:"Ограничения",21007:"Позиции",21008:"Сообщения брокера",
    # 21009:"Ответы на транзакции",21011:"Основные торги",21011:"Торги для ТТП",21012:"Купить/Продать",
    # 21013:"Портфель",21014:"Стаканы",21015:"Ответ по RFS",21016:"Графики",21017:"Новости",21018:"Тексты новостей",
    # 21019:"Валютные пары",21020:"Инфо по бумаге",21021:"Котировки RFS",21022:"Торговые счета",21023:"Торги по
    # вал.парам",21024:"Список вал.пар",22000:"Ответ по заявке",22001:"Ответ по стоп-заявке",22002:"Ответ по
    # связ.стоп-заявке",22003:"Ответ по услов.стоп-заявке",22004:"Ответ по FX-заявке",22100:"Ответ по снятию заявки",
    # 22101:"Ответ по снятию стоп-заявки"},

    PIN_REQ = 20001
    AUTH = 20006
    STATUS = 20008
    TRADE_SESSION_OPEN = 20000
    SERVER_MSG = 20014
    EXIT = 10006
    CREATE_DATASOURCE = 11016
    CREATE_LEVEL2_DATASOURCE = 11014
    QUOTES = 21011
    GRAPH = 21016
    LEVEL2 = 21014  # 21014:"Стаканы"

    # Broker messages ???
    ORDERS = 21001  # 21001:"Заявки",
    TRADES = 21003  # 21003:"Сделки",
    LIMITS = 21006  # 21006: "Ограничения",
    MONEY_LIMITS = 21004  # 21004:"Денежн.лимиты"
    STOCK_LIMITS = 21005  # 21005:"Бумаж.лимиты",
    POSITIONS = 21007  # 21007:"Позиции"
    TRANS_REPLY = 21009  # 21009:"Ответы на транзакции"
    BUYSELL = 21012  #:"Купить/Продать",
    PORTFOLIO = 21013  # 21013:"Портфель",
    TRADE_ACCOUNTS = 21022  # 21022:"Торговые счета",
    TRADES_FX = 21023  # 21023:"Торги по  # вал.парам"
    LIMIT_HAS_RECEIVED = 21063  # LimitHasReceived = 21063
    # MSG_ID_LEVEL2 = 21014,  # 21014:"Стаканы"

    ORDER = 12000
    ORDER_REPLY = 22000  # 22000:"Ответ по заявке"
    STOP_ORDER_REPLY = 22001  # 22001:"Ответ по стоп-заявке"
    LINKED_STOP_ORDER_REPLY = 22002  # 22002:"Ответ по связ.стоп-заявке"
    CONDITIONAL_STOP_ORDER_REPLY = 22003  # 22003:"Ответ по услов.стоп-заявке"
    FX_ORDER_REPLY = 22004  # ,22004:"Ответ по FX-заявке",
    REMOVE_ORDER_REPLY = 22100  # 22100:"Ответ по снятию заявки",
    REMOVE_STOP_ORDER_REPLY = 22101  # 22101:"Ответ по снятию стоп-заявки"
